import Paragraph from "@/components/global/Paragraph";
import Layout from "@/components/layout/clientLayout";
import { fadeIn } from "@/libs/variants";
import { motion } from "framer-motion";

const Comagain = () => {
  return (
    <>
      <div className="pt-0 lg:pt-[104px]">
        <motion.div
          variants={fadeIn("up", 0.4)}
          initial="hidden"
          animate={"show"}
          className="flex items-center"
        >
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 405.718 70.231"
            className="w-[179px] md:w-[250px] 2xl:w-[405.718px]"
          >
            <g
              id="그룹_224"
              data-name="그룹 224"
              transform="translate(-117.381 -224.165)"
            >
              <g
                id="그룹_118"
                data-name="그룹 118"
                transform="translate(117.381 224.165)"
              >
                <g id="그룹_117" data-name="그룹 117">
                  <path
                    id="패스_353"
                    data-name="패스 353"
                    d="M185.138,281.132a98.586,98.586,0,0,1-4.2,11.625A68.555,68.555,0,0,1,167,294.611c-18.6,0-27.728-12.291-27.728-25.385,0-15.565,11.835-26.278,29.1-26.278,6.559,0,11.98,1.41,14.381,1.763.318,3.451.851,8.208,1.445,11.929l-2.482.534c-1.536-5.249-3.444-8.313-7.351-9.912a20.522,20.522,0,0,0-7.742-1.376c-12.281,0-18.709,9.268-18.709,21.712,0,14.549,7.528,23.983,19.511,23.983,7.515,0,11.4-3.536,15.323-11.281Z"
                    transform="translate(-139.275 -242.948)"
                    fill="#fff"
                  />
                  <path
                    id="패스_354"
                    data-name="패스 354"
                    d="M192.364,254c9.731,0,16.752,7.379,16.752,17.072,0,12.311-9.075,18.225-16.806,18.225a16.82,16.82,0,0,1-17.1-17.076C175.212,259.957,184.862,254,192.364,254Zm-.912,2.668c-4.4,0-8.4,4.3-8.4,13.221,0,9.621,4.055,16.663,10.034,16.663,4.389,0,8.195-3.165,8.195-13.711C201.278,263.64,197.791,256.671,191.452,256.671Z"
                    transform="translate(-122.754 -237.866)"
                    fill="#fff"
                  />
                  <path
                    id="패스_355"
                    data-name="패스 355"
                    d="M243.639,288.459v-2.213c4.229-.455,4.763-.761,4.763-5.965V267.494c0-5.567-2.032-8.58-6.325-8.58-2.645,0-5.144,1.393-7.94,3.668.076.914.215,1.868.215,3.26V280.71c0,4.7.6,5.08,4.664,5.535v2.213H222.584v-2.213c4.471-.455,5.087-.746,5.087-5.659V267.363c0-5.589-1.819-8.462-6.131-8.462-2.839,0-5.6,1.807-7.919,3.655v18.031c0,4.884.52,5.2,4.584,5.659v2.213H201.653v-2.213c4.873-.47,5.287-.775,5.287-5.715V264.713c0-4.759-.263-5.132-4.4-5.852v-2a46.59,46.59,0,0,0,11.082-3.016v6.08a57.632,57.632,0,0,1,5.454-3.8,10.613,10.613,0,0,1,6.093-2.048c3.762,0,6.826,2.283,8.335,6.157,2.076-1.619,3.97-2.871,5.874-4.165a11.56,11.56,0,0,1,6.024-1.993c6.058,0,9.682,4.3,9.682,11.814v14.7c0,4.934.444,5.175,4.671,5.659v2.213Z"
                    transform="translate(-110.598 -237.937)"
                    fill="#fff"
                  />
                  <path
                    id="패스_356"
                    data-name="패스 356"
                    d="M268.848,289.3a5.8,5.8,0,0,1-3.782-1.473,7.09,7.09,0,0,1-1.852-3.314c-3.017,2.026-6.745,4.786-8.939,4.786a9.45,9.45,0,0,1-9.475-9.44c0-3.784,2.014-6.108,6.172-7.582,4.613-1.612,10.374-3.563,12.062-4.96v-1.849c0-5.143-2.506-8.1-6.34-8.1a4.3,4.3,0,0,0-3.48,1.709,15.987,15.987,0,0,0-2.013,4.959,2.276,2.276,0,0,1-2.4,1.9,3.833,3.833,0,0,1-3.553-3.457c0-1.121.975-2.047,2.538-3.14,2.425-1.721,6.852-4.427,11.176-5.34a11.018,11.018,0,0,1,6.652,2.082c2.772,2.283,3.934,4.979,3.934,8.922v14.41c0,3.528,1.28,4.566,2.623,4.566a5.974,5.974,0,0,0,2.67-.8l.775,2.213Zm-5.816-19.236c-1.619.825-4.859,2.271-6.569,3.045-2.8,1.28-4.477,2.714-4.477,5.487a5.464,5.464,0,0,0,5.328,5.845,9.052,9.052,0,0,0,5.718-2.466Z"
                    transform="translate(-90.762 -237.866)"
                    fill="#fff"
                  />
                  <path
                    id="패스_357"
                    data-name="패스 357"
                    d="M278.607,277.2c-1.633,1.336-2.3,2.7-2.3,3.585,0,1.343,1.321,2.879,4.649,2.879,2.747,0,6.024-.063,8.535-.063,4.829,0,11.164,1.651,11.164,9.172,0,8.036-9.564,15.383-19.685,15.383-8.845,0-13.457-4.994-13.583-9.429a5.694,5.694,0,0,1,1.971-4.309,79.311,79.311,0,0,1,6.143-5.178,10.1,10.1,0,0,1-5.706-4.135,6.763,6.763,0,0,1-.968-3.438,17.156,17.156,0,0,0,7.218-5.3Zm3.652.761c-7.363,0-13.181-4.391-13.181-11.49,0-8.592,7.789-12.6,13.889-12.6a16.105,16.105,0,0,1,7.537,1.917,51.965,51.965,0,0,0,10.25-1.128l.442.67c-.457,1.245-1.632,3.445-2.816,4.157-1.168,0-3.611-.305-4.676-.381a11.29,11.29,0,0,1,2.139,6.8C295.843,274.081,288.968,277.961,282.259,277.961Zm1.6,11.507c-3.754,0-5.47.458-6.8,1.571-1.981,1.628-3.379,3.772-3.379,5.869,0,4.157,4.241,7.277,10.223,7.277,6.982,0,11.009-3.549,11.009-8.283a5.605,5.605,0,0,0-3.5-5.5C289.485,289.621,286.986,289.468,283.859,289.468Zm-1.585-33.076c-3.232,0-6.153,3.065-6.153,8.994,0,5.861,2.811,10.059,6.886,10.059,3.28-.124,6.014-3,6.014-9.034C289.021,260.679,286.425,256.392,282.274,256.392Z"
                    transform="translate(-80.379 -237.924)"
                    fill="#fff"
                  />
                  <path
                    id="패스_358"
                    data-name="패스 358"
                    d="M316.385,289.3a5.806,5.806,0,0,1-3.782-1.473,7.1,7.1,0,0,1-1.852-3.314c-3.017,2.026-6.744,4.786-8.939,4.786a9.449,9.449,0,0,1-9.474-9.44c0-3.784,2.013-6.108,6.17-7.582,4.613-1.612,10.374-3.563,12.063-4.96v-1.849c0-5.143-2.506-8.1-6.34-8.1a4.293,4.293,0,0,0-3.48,1.709,16.024,16.024,0,0,0-2.013,4.959,2.278,2.278,0,0,1-2.4,1.9,3.833,3.833,0,0,1-3.554-3.457c0-1.121.975-2.047,2.54-3.14,2.425-1.721,6.852-4.427,11.174-5.34a11.008,11.008,0,0,1,6.651,2.082c2.773,2.283,3.935,4.979,3.935,8.922v14.41c0,3.528,1.28,4.566,2.622,4.566a5.969,5.969,0,0,0,2.671-.8l.775,2.213Zm-5.814-19.236c-1.62.825-4.861,2.271-6.569,3.045-2.8,1.28-4.477,2.714-4.477,5.487a5.462,5.462,0,0,0,5.327,5.845,9.056,9.056,0,0,0,5.719-2.466Z"
                    transform="translate(-68.907 -237.866)"
                    fill="#fff"
                  />
                  <path
                    id="패스_359"
                    data-name="패스 359"
                    d="M315.508,293.354v-2.213c4.67-.47,5.189-.836,5.189-6.052V269.566c0-4.785-.257-5.09-4.643-5.8v-1.95a55.245,55.245,0,0,0,11.339-2.987v26.256c0,5.175.492,5.582,5.341,6.052v2.213Zm8.09-41.473a4.41,4.41,0,0,1-4.292-4.279,4.35,4.35,0,0,1,4.369-4.4,4.217,4.217,0,0,1,4.168,4.4A4.3,4.3,0,0,1,323.6,251.882Z"
                    transform="translate(-58.255 -242.833)"
                    fill="#fff"
                  />
                  <path
                    id="패스_360"
                    data-name="패스 360"
                    d="M351.78,288.459v-2.213c4.194-.455,4.61-.947,4.61-6.135V267.474c0-5.34-2.041-8.573-6.637-8.573-2.914,0-5.648,1.634-7.951,3.655V280.47c0,5.141.429,5.321,4.671,5.776v2.213H329.818v-2.213c4.829-.559,5.287-.823,5.287-5.832v-15.7c0-4.877-.547-5.106-4.519-5.789v-2.061a48.884,48.884,0,0,0,11.241-3.016c-.013,1.626-.026,4.1-.026,5.915,1.521-1.066,3.181-2.207,5.119-3.458a11.429,11.429,0,0,1,6.246-2.229c6.1,0,9.919,4.489,9.919,11.938v14.444c0,5.091.456,5.319,4.733,5.789v2.213Z"
                    transform="translate(-51.676 -237.937)"
                    fill="#fff"
                  />
                </g>
                <path
                  id="패스_361"
                  data-name="패스 361"
                  d="M442.083,259.52,429.9,244.785a1.945,1.945,0,0,0-3,0L414.722,259.52a1.944,1.944,0,0,0,1.5,3.182h7.551c0,.029-.009.057-.009.086h0a26.154,26.154,0,0,1-52.307.471h0a4.655,4.655,0,0,0-9.31.083h0c0,.039,0,.08,0,.12a35.466,35.466,0,0,0,70.927-.758h0v0h7.51A1.944,1.944,0,0,0,442.083,259.52Z"
                  transform="translate(-36.814 -242.428)"
                  fill="#f6c845"
                />
              </g>
            </g>
          </svg>
        </motion.div>
        <div className="mt-[15px] lg:mt-[45px]">
          <Paragraph hasImg>
            <strong className="font-bold">컴</strong>
            <strong className="font-bold">어</strong>
            <strong className="font-bold">게</strong>
            <strong className="font-bold">인</strong>
            <span>{"은\n"}</span>
            <strong className="font-bold">소</strong>
            <strong className="font-bold">상</strong>
            <strong className="font-bold">공</strong>
            <strong className="font-bold">인</strong>
            <strong className="font-bold">{", "}</strong>
            <strong className="font-bold">프</strong>
            <strong className="font-bold">렌</strong>
            <strong className="font-bold">차</strong>
            <strong className="font-bold">이</strong>
            <strong className="font-bold">즈</strong>
            <strong className="font-bold">{", "}</strong>
            <strong className="font-bold">통</strong>
            <strong className="font-bold">신</strong>
            <strong className="font-bold">판</strong>
            <strong className="font-bold">매</strong>
            <strong className="font-bold">업</strong>
            <strong className="font-bold">을</strong>
            <span>{" 위"}</span>
            <span>{"한\n"}</span>
            <strong className="font-bold">C</strong>
            <strong className="font-bold">R</strong>
            <strong className="font-bold">M</strong>
            <strong className="font-bold">솔</strong>
            <strong className="font-bold">루</strong>
            <strong className="font-bold">션</strong>
            <span>{" 으"}</span>
            <span>{"로"}</span>
            <span>{"써\n"}</span>
            <strong className="font-bold">고</strong>
            <strong className="font-bold">객</strong>
            <strong className="font-bold">관</strong>
            <strong className="font-bold">리</strong>
            <strong className="font-bold">{", "}</strong>
            <strong className="font-bold">상</strong>
            <strong className="font-bold">품</strong>
            <strong className="font-bold">관</strong>
            <strong className="font-bold">리</strong>
            <strong className="font-bold">{", "}</strong>
            <strong className="font-bold">온</strong>
            <strong className="font-bold">라</strong>
            <strong className="font-bold">인</strong>
            <strong className="font-bold">결</strong>
            <strong className="font-bold">{"제 "}</strong>
            <strong className="font-bold">{"및 "}</strong>
            <strong className="font-bold">리</strong>
            <strong className="font-bold">워</strong>
            <strong className="font-bold">드</strong>
            <span>{"를\n"}</span>
            <span>제</span>
            <span>공</span>
            <span>하</span>
            <span>{"는 "}</span>
            <span>플</span>
            <span>랫</span>
            <span>폼</span>
            <span>입</span>
            <span>니</span>
            <span>다</span>
            <span>.</span>
          </Paragraph>
        </div>
      </div>
    </>
  );
};

export default Comagain;
